# Import Nessesory Libries

In [1]:
# import all the nessecery libries for machine learning project
import pandas as pd

# Import Data Sets

In [2]:
# Import data set
outlet_data=pd.read_csv('Data Storn - Semi final data sets/outlets_data.csv')
freezer_data=pd.read_csv('Data Storn - Semi final data sets/freezer_data.csv')
product_data=pd.read_csv('Data Storn - Semi final data sets/product_data.csv')
sales_data=pd.read_csv('Data Storn - Semi final data sets/sales_data.csv')
week_data=pd.read_csv('Data Storn - Semi final data sets/week_data.csv')

In [3]:
outlet_data

    Outlet_ID  area(sqft)
0      ID7203        5660
1      ID1878        4138
2      ID1740        5546
3      ID4366        5134
4      ID8358        4100
..        ...         ...
983    ID4119        3858
984    ID2978        3495
985    ID6549        1141
986    ID1210        3322
987    ID8207        3539

[988 rows x 2 columns]

In [6]:
product_data

   pid  volume                     product_name  price
0  IP1     0.2                Vanilla Mini Cone    100
1  IP2     0.2             Chocolate Petite Bar     90
2  IP3     0.2              Strawberry Tiny Cup    110
3  IP4     0.2               Mint Bite-size Pop    100
4  IP5     0.2         Butter Pecan Small Stick    100
5  BP1     1.0        Chocolate Fudge Big Scoop   1200
6  BP2     1.0           Moose Tracks Jumbo Cup   1100
7  BP3     1.0  Mint Chocolate Chip Family Pack   1150
8  BP4     1.0              Rocky Road Mega Tub   1000
9  BP5     1.0       Cookies and Cream Mega Tub   1100

In [7]:
sales_data

      Outlet_ID  week  pid                     product_name  no_units
0        ID7203     1  IP1                Vanilla Mini Cone     874.0
1        ID7203     1  IP2             Chocolate Petite Bar     105.0
2        ID7203     1  IP3              Strawberry Tiny Cup    1198.0
3        ID7203     1  IP4               Mint Bite-size Pop     502.0
4        ID7203     1  IP5         Butter Pecan Small Stick     710.0
...         ...   ...  ...                              ...       ...
80995    ID8207    12  BP1        Chocolate Fudge Big Scoop      56.0
80996    ID8207    12  BP2           Moose Tracks Jumbo Cup      60.0
80997    ID8207    12  BP3  Mint Chocolate Chip Family Pack      51.0
80998    ID8207    12  BP4              Rocky Road Mega Tub      78.0
80999    ID8207    12  BP5       Cookies and Cream Mega Tub      73.0

[81000 rows x 5 columns]

In [8]:
week_data

       Week Start Date   End Date
0    Week 1   1/2/2023   1/8/2023
1    Week 2   1/9/2023  1/15/2023
2    Week 3  1/16/2023  1/22/2023
3    Week 4  1/23/2023  1/29/2023
4    Week 5  1/30/2023   2/5/2023
5    Week 6   2/6/2023  2/12/2023
6    Week 7  2/13/2023  2/19/2023
7    Week 8  2/20/2023  2/26/2023
8    Week 9  2/27/2023   3/5/2023
9   Week 10   3/6/2023  3/12/2023
10  Week 11  3/13/2023  3/19/2023
11  Week 12  3/20/2023  3/26/2023

# Creating Dtaframes

In [15]:
sales_grouped_outlats = sales_data.groupby(['Outlet_ID', 'pid'])['no_units'].sum().reset_index()
# Rename 'price' column to 'num_of_times_item_sold'

In [16]:
sales_grouped_outlats

     Outlet_ID  pid  no_units
0       ID1008  IP1    6970.0
1       ID1008  IP2    7206.0
2       ID1008  IP3    6285.0
3       ID1008  IP4    6486.0
4       ID1008  IP5    6055.0
...        ...  ...       ...
7185    ID9980  IP1    6212.0
7186    ID9980  IP2    7888.0
7187    ID9980  IP3    4999.0
7188    ID9980  IP4    9370.0
7189    ID9980  IP5    8990.0

[7190 rows x 3 columns]

In [17]:
# pivot the dataframe to make item_description values as columns
pivoted_df_sales = sales_grouped_outlats.pivot(index='Outlet_ID', columns='pid', values='no_units')

# fill NaN values with 0
pivoted_df_sales.fillna(0, inplace=True)

# resetting the index
pivoted_df_sales = pivoted_df_sales.reset_index()

In [18]:
pivoted_df_sales

pid,Outlet_ID,BP1,BP2,BP3,BP4,BP5,IP1,IP2,IP3,IP4,IP5
0,ID1008,0.0,0.0,0.0,0.0,0.0,6970.0,7206.0,6285.0,6486.0,6055.0
1,ID1012,636.0,713.0,795.0,572.0,559.0,0.0,0.0,0.0,0.0,0.0
2,ID1024,1703.0,1251.0,1150.0,1388.0,1451.0,0.0,0.0,0.0,0.0,0.0
3,ID1029,1659.0,2190.0,1891.0,1513.0,1109.0,9166.0,7577.0,9158.0,7961.0,6918.0
4,ID1036,567.0,583.0,725.0,564.0,722.0,4934.0,5708.0,6200.0,5526.0,5835.0
...,...,...,...,...,...,...,...,...,...,...,...
946,ID9960,1815.0,1878.0,1359.0,1958.0,2257.0,7142.0,6123.0,8809.0,5699.0,11328.0
947,ID9971,0.0,0.0,0.0,0.0,0.0,6390.0,6784.0,7786.0,9162.0,6361.0
948,ID9973,1411.0,1970.0,2001.0,1317.0,1870.0,7341.0,6473.0,8091.0,9850.0,7744.0
949,ID9979,0.0,0.0,0.0,0.0,0.0,5596.0,7372.0,6283.0,5740.0,6901.0
950,ID9980,2462.0,2094.0,2374.0,2435.0,1871.0,6212.0,7888.0,4999.0,9370.0,8990.0

In [19]:
sales_grouped_outlats=(pd.merge(sales_grouped_outlats, pivoted_df_sales, on='Outlet_ID', how='left'))

In [20]:
sales_grouped_outlats

,Outlet_ID,pid,no_units,BP1,BP2,BP3,BP4,BP5,IP1,IP2,IP3,IP4,IP5
0,ID1008,IP1,6970.0,0.0,0.0,0.0,0.0,0.0,6970.0,7206.0,6285.0,6486.0,6055.0
1,ID1008,IP2,7206.0,0.0,0.0,0.0,0.0,0.0,6970.0,7206.0,6285.0,6486.0,6055.0
2,ID1008,IP3,6285.0,0.0,0.0,0.0,0.0,0.0,6970.0,7206.0,6285.0,6486.0,6055.0
3,ID1008,IP4,6486.0,0.0,0.0,0.0,0.0,0.0,6970.0,7206.0,6285.0,6486.0,6055.0
4,ID1008,IP5,6055.0,0.0,0.0,0.0,0.0,0.0,6970.0,7206.0,6285.0,6486.0,6055.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
7185,ID9980,IP1,6212.0,2462.0,2094.0,2374.0,2435.0,1871.0,6212.0,7888.0,4999.0,9370.0,8990.0
7186,ID9980,IP2,7888.0,2462.0,2094.0,2374.0,2435.0,1871.0,6212.0,7888.0,4999.0,9370.0,8990.0
7187,ID9980,IP3,4999.0,2462.0,2094.0,2374.0,2435.0,1871.0,6212.0,7888.0,4999.0,9370.0,8990.0
7188,ID9980,IP4,9370.0,2462.0,2094.0,2374.0,2435.0,1871.0,6212.0,7888.0,4999.0,9370.0,8990.0
7189,ID9980,IP5,8990.0,2462.0,2094.0,2374.0,2435.0,1871.0,6212.0,7888.0,4999.0,9370.0,8990.0